# ReplaceReferenceTargets Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarConstraint..::..ReplaceReferenceTargets Method
RebarConstraint Class See Also
---
Replaces the current set of references, the type of constraint and the offset value, with the newly provided ones. Will throw exception if this is a constraint for Shape Driven Rebar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2018
# Syntax
C#
---
```text
public void ReplaceReferenceTargets(
	RebarConstrainedHandle handle,
	IList<Reference> targetReferences,
	bool isConstraintToCover,
	double offsetValue
)
```

Visual Basic
---
```text
Public Sub ReplaceReferenceTargets ( _
	handle As RebarConstrainedHandle, _
	targetReferences As IList(Of Reference), _
	isConstraintToCover As Boolean, _
	offsetValue As Double _
)
```

Visual C++
---
```text
public:
void ReplaceReferenceTargets(
	RebarConstrainedHandle^ handle,
	IList<Reference^>^ targetReferences,
	bool isConstraintToCover,
	double offsetValue
)
```

# ### Parameters
handle
    Type: Autodesk.Revit.DB.Structure..::..RebarConstrainedHandle The RebarConstrainedHandle that has this constraint.
targetReferences
    Type: System.Collections.Generic..::..IList<(Of <(<'Reference>)>)> The references to which the rebar handle will be constrained. This collection must contain one or more references to faces of elements that can host rebar.
isConstraintToCover
    Type: System..::..Boolean If true the RebarConstraintType will be set to ToCover, otherwise RebarConstraintType will be set to FixedDistanceToHostFace.
offsetValue
    Type: System..::..Double The distance from references to the rebar handle.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | handle is no longer valid. -or- targetReferences is empty. -or- targetReferences do not represent faces from structurals that can host rebar. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Constrained rebar is a shape driven rebar element. |

# See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace